#Задача-6..
#Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
#Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
#Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
#Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
#Например: a = 2, b = 3.
#Результат:
#1-й день: 2
#2-й день: 2,2
#3-й день: 2,42
#4-й день: 2,66
#5-й день: 2,93
#6-й день: 3,22

#Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.

distane_first_day = int(input("Введите результаты пробежки первого дня в км:"))
distane_arrive = int(input("Введите общий желаемый результат в км:"))
result_days = 1

while distane_first_day < distane_arrive:
       distane_first_day = distane_first_day + (distane_first_day * 0.1)
       result_days += 1

print(f"На {result_days} день, спортсмен достиг результата — не менее {distane_arrive} км")
